""" Настройки принтера """

PORT = "COM6"   # Смотреть в диспетчере
BAUDRATE = 115200

MAX_X = 100			# Максимальная область печати по оси X
MIN_X = 1           # Минимальная область по оси Х
MAX_Y = 100			# Максимальная область печати по оси Y
MIN_Y = 1           # Минимальная область по оси Х
MAX_Z = 100			# Максимальная область печати по оси Z
MIN_Z = 1           # Минимальная область по оси Х

STEP = 2			# Шаг по Х и Y
STEPZ = 0.2			# Шаг по Z

XPOS = -20			# Позиция X
YPOS = 160			# Позиция Y
ZPOS = 0			# Позиция Z


